FROM node:16
# создание директории приложения
WORKDIR /usr/src/app
# установка зависимостей
# символ астериск ("*") используется для того чтобы по возможности
# скопировать оба файла: package.json и package-lock.json
COPY package*.json ./
RUN npm install

# копируем исходный код
COPY . .

#Сервер привязан к 8080 порту, поэтому мы будем использовать инструкцию EXPOSE, 
#чтобы проинформировать Docker о том, что в контейнере имеется приложение, прослушивающее этот порт.
#EXPOSE 4000
CMD ["node", "index.js"]